const imgUrl = 'https://pic.rmb.bdstatic.com/bjh/gallery/03e17cba710868d9153176b50a5fca0d1090.jpeg'
export const data = [
  {
    title: "不太聪明的脑子的思考原因",
    content: `<p>最近回老家面试了一个工作，发现老家的思想的底层逻辑是：到了这个年纪女性就应该相夫教子，不愿意给女性与男性同等的工资标准或对女性进行培养， <br><br>看到他们这种嘴脸真的不想回去，但是目前互联网环境也不好，对未来开始变得迷茫不安， <br> <br>不过作为i型人格真的很喜欢这种沉浸式工作，暂时没有换行业的打算，所以还是先从目前做程序出发，去提升自己的能力，争取能再多干个几年，然后回东北老家花几万块买个小房子，开始我的摆烂养老人生
<strong>（人生终极目标）</strong> <br> <br>
在此总结一下今年上半年的成果和下半年的目标吧~</p>`
  },
  {
    title: "上半年成果",
    children: [
      {
        title: "1.刷力扣拿到排名",
        content: `<p>摆烂人生是在去年感知到危机的时候结束的，于是开始疯狂刷LeetCode，学习算法，最终的结果是对待代码问题脑子变得灵光了但生活中越发糊涂了，但是目前困难的题还是基本摸不到头绪的状态，好多数学公式也不知道，位运算符也不咋会用，就目前感觉自己还是很差，提升的空间还是非常非常高的<br>
<em>（今年四月拿到排名时截的图）</em></p><img src="${imgUrl}" width="70%" loading="lazy" class="medium-zoom-image">`,
      },
      {
        title: "2.开始准备软考",
        content: `<p>年初的时候开始考虑考一个专业资格证，于是开始做一些功课，上半年从bilibili上看了一些公开的课先做了初步了解，六月份买了一套课开始进行系统的学习，备战11月的考试</p><img src="${imgUrl}" alt="微信图片_20230823180721.png" width="50%" loading="lazy" class="medium-zoom-image"><img src="${imgUrl}"" alt="微信图片_20230823180710.png" width="50%" loading="lazy" class="medium-zoom-image">`,
      },
      {
        title: "3.涨薪",
        content: `<p>很幸运自己能在目前经济环境下行的情况下没有失业，并且领导对我还算认可，给我们在竞争中留下来的人涨了工资，但说是涨薪，其实最终结果我们未必拿到的多了，因为目前公司效益不景气，如果公司效益持续低迷，年底的14薪必定要打水漂，但是还能稳定的存活下来也算是比较满意了，真心希望公司越来越好，因为我们的老板人真的非常不错（虽然我不接受pua但是发自内心感谢公司）</p>`,
      },
      {
        title: "4.买了自行车开始骑行健身",
        content: `<p>其实早就想买个自行车，可以骑行上班，周末也可以当运动，不过身边的好多人都不赞同，因为像夏天太热、冬天太冷、刮风下雨都骑不出去，但是最终我还是买了，嘎嘎开心，不过确实影响因素很多最终也没骑过几次哈哈（主要是本人太懒总是找借口不骑车出门）</p><img src="${imgUrl}" alt="微信图片_20230823181638.jpg" width="70%" loading="lazy" class="medium-zoom-image">`,
      },
    ]
  },
  {
    title: "下半年目标",
    children: [
      {
        title: "1.软考通过！",
        content: `<p>摆烂人生是在去年感知到危机的时候结束的，于是开始疯狂刷LeetCode，学习算法，最终的结果是对待代码问题脑子变得灵光了但生活中越发糊涂了，但是目前困难的题还是基本摸不到头绪的状态，好多数学公式也不知道，位运算符也不咋会用，就目前感觉自己还是很差，提升的空间还是非常非常高的<br>
<em>（今年四月拿到排名时截的图）</em></p><img src="${imgUrl}" alt="微信图片_20230823180111.jpg" width="70%" loading="lazy" class="medium-zoom-image">`,
      },
      {
        title: "2.争取换一个更高的平台",
        content: `<p>年初的时候开始考虑考一个专业资格证，于是开始做一些功课，上半年从bilibili上看了一些公开的课先做了初步了解，六月份买了一套课开始进行系统的学习，备战11月的考试</p><img src="${imgUrl}" alt="微信图片_20230823180710.png" width="50%" loading="lazy" class="medium-zoom-image">`,
      },
      {
        title: "3.持续精进算法",
        content: `<p>很幸运自己能在目前经济环境下行的情况下没有失业，并且领导对我还算认可，给我们在竞争中留下来的人涨了工资，但说是涨薪，其实最终结果我们未必拿到的多了，因为目前公司效益不景气，如果公司效益持续低迷，年底的14薪必定要打水漂，但是还能稳定的存活下来也算是比较满意了，真心希望公司越来越好，因为我们的老板人真的非常不错（虽然我不接受pua但是发自内心感谢公司）</p>`,
      },
      {
        title: "4.买了自行车开始骑行健身",
        content: `<p>其实早就想买个自行车，可以骑行上班，周末也可以当运动，不过身边的好多人都不赞同，因为像夏天太热、冬天太冷、刮风下雨都骑不出去，但是最终我还是买了，嘎嘎开心，不过确实影响因素很多最终也没骑过几次哈哈（主要是本人太懒总是找借口不骑车出门）</p><img src="${imgUrl}" width="30%" loading="lazy" class="medium-zoom-image">`,
      },
      
      
    ]
  }
]